tokihk/sdbox/src_board/nxp_mimxrt1170_evkb/driver/xdriver_board.h
/*
 * xdriver_board.h
 *
 *  Created on: 2024/03/19
 *      Author: Hitoshi Kono
 */

#ifndef XDRIVER_BOARD_H_
#define XDRIVER_BOARD_H_

#include "core/xstddef.h"

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_dmamux.h"
#include "fsl_edma.h"
#include "fsl_gpio.h"

#include "pin_mux.h"


static void xboard_pin_init(void)
{
	CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
	CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */

	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_17_SAI1_MCLK,            /* GPIO_AD_17 is configured as SAI1_MCLK */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_17 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_21_SAI1_TX_DATA00,       /* GPIO_AD_21 is configured as SAI1_TX_DATA00 */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_21 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_22_SAI1_TX_BCLK,         /* GPIO_AD_22 is configured as SAI1_TX_BCLK */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_22 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_23_SAI1_TX_SYNC,         /* GPIO_AD_23 is configured as SAI1_TX_SYNC */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_23 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_GPR->GPR0 = ((IOMUXC_GPR->GPR0 &
	(~(IOMUXC_GPR_GPR0_SAI1_MCLK_DIR_MASK)))  /* Mask bits to zero which are setting */
	  | IOMUXC_GPR_GPR0_SAI1_MCLK_DIR(0x01U)  /* SAI1_MCLK signal direction control: 0x01U */
	);
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */


	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */

	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_17_SAI1_MCLK,            /* GPIO_AD_17 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_21_SAI1_TX_DATA00,       /* GPIO_AD_21 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_22_SAI1_TX_BCLK,         /* GPIO_AD_22 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_23_SAI1_TX_SYNC,         /* GPIO_AD_23 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
	  0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 PAD functional properties : */
	  0x0AU);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high driver
												 Pull / Keep Select Field: Pull Disable
												 Pull Up / Down Config. Field: Weak pull up
												 Open Drain LPSR Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 PAD functional properties : */
	  0x0AU);                                 /* Slew Rate Field: Slow Slew Rate
												 Drive Strength Field: high driver
												 Pull / Keep Select Field: Pull Disable
												 Pull Up / Down Config. Field: Weak pull up
												 Open Drain LPSR Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */

