tokihk/sdbox/src_board/nxp_mimxrt1170_evkb/driver/xdriver_board.h
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitEnetPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void xboard_pin_init_enet(void)
{
	CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
//	CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_12_GPIO9_IO11,           /* GPIO_AD_12 is configured as GPIO9_IO11 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_32_ENET_MDC,             /* GPIO_AD_32 is configured as ENET_MDC */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_AD_33_ENET_MDIO,            /* GPIO_AD_33 is configured as ENET_MDIO */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_02_ENET_TX_DATA00,  /* GPIO_DISP_B2_02 is configured as ENET_TX_DATA00 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_03_ENET_TX_DATA01,  /* GPIO_DISP_B2_03 is configured as ENET_TX_DATA01 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_04_ENET_TX_EN,      /* GPIO_DISP_B2_04 is configured as ENET_TX_EN */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_05_ENET_REF_CLK,    /* GPIO_DISP_B2_05 is configured as ENET_REF_CLK */
	  1U);                                    /* Software Input On Field: Force input path of pad GPIO_DISP_B2_05 */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_06_ENET_RX_DATA00,  /* GPIO_DISP_B2_06 is configured as ENET_RX_DATA00 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_07_ENET_RX_DATA01,  /* GPIO_DISP_B2_07 is configured as ENET_RX_DATA01 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_08_ENET_RX_EN,      /* GPIO_DISP_B2_08 is configured as ENET_RX_EN */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_DISP_B2_09_ENET_RX_ER,      /* GPIO_DISP_B2_09 is configured as ENET_RX_ER */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_GPR->GPR4 = ((IOMUXC_GPR->GPR4 &
	(~(IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_MASK))) /* Mask bits to zero which are setting */
	  | IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR(0x01U) /* ENET_REF_CLK direction control: 0x01U */
	);
	IOMUXC_SetPinMux(
	  IOMUXC_GPIO_LPSR_12_GPIO12_IO12,        /* GPIO_LPSR_12 is configured as GPIO12_IO12 */
	  0U);                                    /* Software Input On Field: Input Path is determined by functionality */
	IOMUXC_SetPinConfig(
	  IOMUXC_GPIO_DISP_B2_05_ENET_REF_CLK,    /* GPIO_DISP_B2_05 PAD functional properties : */
	  0x03U);                                 /* Slew Rate Field: Fast Slew Rate
												 Drive Strength Field: high drive strength
												 Pull / Keep Select Field: Pull Disable, Highz
												 Pull Up / Down Config. Field: Weak pull down
												 Open Drain Field: Disabled
												 Domain write protection: Both cores are allowed
												 Domain write protection lock: Neither of DWP bits is locked */
}

static void xboard_pinmux_init(void)
{
	uint32_t mask;

//	CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
//	CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

	/* === Debug Port === */
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_00_GPIO8_IO31, 0);		/* J25-15(PIN)			*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_01_GPIO9_IO00, 0);		/* J25-13(PIN)			*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_02_GPIO9_IO01, 0);		/* J25-11(PIN)			*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_03_GPIO9_IO02, 0);		/* J25-9(PIN)			*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_04_GPIO9_IO03, 0);		/* J25-7(PIN)			*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_05_GPIO9_IO04, 0);		/* D6(LED), J25-5(PIN)	*/
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_26_GPIO9_IO25, 0);		/* D34(LED)				*/

	mask = ((uint32_t)0u << IOMUXC_SW_PAD_CTL_PAD_DWP_LOCK_SHIFT)	/* Neither of DWP bits is locked	*/
		 | ((uint32_t)0u << IOMUXC_SW_PAD_CTL_PAD_DWP_SHIFT)		/* Both cores are allowed			*/
		 | ((uint32_t)0u << IOMUXC_SW_PAD_CTL_PAD_ODE_SHIFT)		/* Open Drain - Disabled			*/
		 | ((uint32_t)1u << IOMUXC_SW_PAD_CTL_PAD_PUS_SHIFT)		/* Weak pull up						*/
		 | ((uint32_t)1u << IOMUXC_SW_PAD_CTL_PAD_PUE_SHIFT)		/* Pull Enable						*/
		 | ((uint32_t)1u << IOMUXC_SW_PAD_CTL_PAD_DSE_SHIFT)		/* normal drive strength			*/
		 | ((uint32_t)1u << IOMUXC_SW_PAD_CTL_PAD_SRE_SHIFT);		/* Fast Slew Rate					*/

	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_00_GPIO8_IO31, mask);	/* J25-15(PIN)			*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_01_GPIO9_IO00, mask);	/* J25-13(PIN)			*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_02_GPIO9_IO01, mask);	/* J25-11(PIN)			*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_03_GPIO9_IO02, mask);	/* J25-9(PIN)			*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_04_GPIO9_IO03, mask);	/* J25-7(PIN)			*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_05_GPIO9_IO04, mask);	/* D6(LED), J25-5(PIN)	*/
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_26_GPIO9_IO25, mask);	/* D34(LED)				*/

