tokihk/sdbox/src_board/nxp_mimxrt1170_evkb/driver/xdriver_board.h
#if 0
	/* デバッグポートとして使用する場合、ドライブ速度が遅いことに注意 */
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_00_DIG_GPIO13_IO03, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_01_DIG_GPIO13_IO04, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_02_DIG_GPIO13_IO05, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_03_DIG_GPIO13_IO06, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_04_DIG_GPIO13_IO07, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_05_DIG_GPIO13_IO08, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_06_DIG_GPIO13_IO09, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_07_DIG_GPIO13_IO10, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_08_DIG_GPIO13_IO11, 0);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SNVS_09_DIG_GPIO13_IO12, 0);
#endif
}

static void xboard_module_clock_init(void)
{
	const clock_sys_pll1_config_t sysPll1Config =
	{
		.pllDiv2En = true,
	};

	clock_root_config_t clock_cfg = {0};

	CLOCK_InitSysPll1(&sysPll1Config);

	/* for ENET 100MHz */
	{
		/* Generate 50M root clock. */
		clock_cfg.mux = 4;
		clock_cfg.div = 10;

		CLOCK_SetRootClock(kCLOCK_Root_Enet1, &clock_cfg);
	}

	/* for ENET1G 1000MHz */
	{
		/* Generate 125M root clock. */
		clock_cfg.mux = 4;
		clock_cfg.div = 4;

		CLOCK_SetRootClock(kCLOCK_Root_Enet2, &clock_cfg);
	}
}

static void xboard_enet_clock_init(void)
{
	IOMUXC_GPR->GPR4 |= IOMUXC_GPR_GPR4_ENET_REF_CLK_DIR_MASK;	/* 50M ENET_REF_CLOCK output to PHY and ENET module. */
	IOMUXC_GPR->GPR5 |= IOMUXC_GPR_GPR5_ENET1G_RGMII_EN_MASK;	/* bit1:iomuxc_gpr_enet_clk_dir */
}

static void xboard_dma_init(void)
{
	/* DMAMUX0 initialize */
	DMAMUX_Init(DMAMUX0);

	/* DMA0 initialize */
	{
		edma_config_t edma_conf;

		EDMA_GetDefaultConfig(&edma_conf);

		EDMA_Init(DMA0, &edma_conf);
	}
}

static void xboard_enet_init(void)
{
	const gpio_pin_config_t gpio_config =
	{
		.direction = kGPIO_DigitalOutput,
		.outputLogic = 0,
		.interruptMode = kGPIO_NoIntmode,
	};

	xboard_pin_init_enet();

	GPIO_PinInit(GPIO12, 12, &gpio_config);

	SDK_DelayAtLeastUs(10000, CLOCK_GetFreq(kCLOCK_CpuClk));

	GPIO_WritePinOutput(GPIO12, 12, 1);

	SDK_DelayAtLeastUs(150000, CLOCK_GetFreq(kCLOCK_CpuClk));
}

static void xboard_enet1g_init(void)
{
	const gpio_pin_config_t gpio_config =
	{
		.direction = kGPIO_DigitalOutput,
		.outputLogic = 0,
		.interruptMode = kGPIO_NoIntmode,
	};

	xboard_pin_enet1g_init();

	GPIO_PinInit(GPIO11, 14, &gpio_config);

	/* For a complete PHY reset of RTL8211FDI-CG, this pin must be asserted low for at least 10ms. And
	 * wait for a further 30ms(for internal circuits settling time) before accessing the PHY register */
	SDK_DelayAtLeastUs(10000, CLOCK_GetFreq(kCLOCK_CpuClk));

	GPIO_WritePinOutput(GPIO11, 14, 1);

	SDK_DelayAtLeastUs(30000, CLOCK_GetFreq(kCLOCK_CpuClk));
}

static inline void xdriver_init_board(void)
{
	xboard_pin_init();
	xboard_pinmux_init();

	xboard_module_clock_init();
	xboard_enet_clock_init();

	xboard_dma_init();

	xboard_enet1g_init();
}

static inline void xdriver_wait_us_board(uint32_t time_us)
{
	/*
	 * cycle_time = 1 / BOARD_BOOTCLOCKRUN_CORE_CLOCK
	 *            = 1 / 996000000Hz
	 *            = 1ns
	 *
	 * nop  : 1 cycle
	 *
	 * subs : 1 cycle
	 * bge  : 1 cycle
	 *
	 * 1us  = 2 cycle * 498 loop
	 * */

	__asm volatile
	(
		"loop1:									\n"
		"		mov		r1, #820				\n"
		"loop2:									\n"
		"		subs	r1, r1, #1 				\n"
		"		bge		loop2					\n"
		"		subs	r0, r0, #1 				\n"
		"		bge		loop1					\n"
	);
}

#endif /* XDRIVER_BOARD_H_ */
